## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J4HTHQV1R676J6AYAT8G4R9K) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"]: Refreshing state... [id=/tools-integrations/observability/database-reports.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/remote-file-path-rules.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/remote-file-path-rules.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.14.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.14.0.html]
aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"]: Refreshing state... [id=/commands/quality-checks/checks/warn-on-use-database.html]
aws_s3_object.redirects["/commands/status/verbose.html"]: Refreshing state... [id=/commands/status/verbose.html]
aws_s3_object.redirects["/start/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/commands/community/marknextchangesetransql.html"]: Refreshing state... [id=/commands/community/marknextchangesetransql.html]
aws_s3_object.redirects["/commands/updatetotagsql.html"]: Refreshing state... [id=/commands/updatetotagsql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/vertica.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/vertica.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/includeall.html"]: Refreshing state... [id=/concepts/changelogs/attributes/includeall.html]
aws_s3_object.redirects["/commands/flow/if-conditionals.html"]: Refreshing state... [id=/commands/flow/if-conditionals.html]
aws_s3_object.redirects["/change-types/community/delete.html"]: Refreshing state... [id=/change-types/community/delete.html]
aws_s3_object.redirects["/feature-flags/readmes/ConfigCat Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/ConfigCat Feature Flags Extension.html]
aws_s3_object.redirects["/commands/quality-checks/checks/primary-key-on-create-table.html"]: Refreshing state... [id=/commands/quality-checks/checks/primary-key-on-create-table.html]
aws_s3_object.redirects["/commands/rollbackbytag.html"]: Refreshing state... [id=/commands/rollbackbytag.html]
aws_s3_object.redirects["/commands/community/dbdoc.html"]: Refreshing state... [id=/commands/community/dbdoc.html]
aws_s3_object.redirects["/change-types/pro/drop-synonym.html"]: Refreshing state... [id=/change-types/pro/drop-synonym.html]
aws_s3_object.redirects["/concepts/contexts.html"]: Refreshing state... [id=/concepts/contexts.html]
aws_s3_object.redirects["/tools-integrations/remote-files/searchpath.html"]: Refreshing state... [id=/tools-integrations/remote-files/searchpath.html]
aws_s3_object.redirects["/concepts/advanced/logfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/logfile-parameter.html]
aws_s3_object.redirects["/commands/working-with-command-parameters.html"]: Refreshing state... [id=/commands/working-with-command-parameters.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-warn.html]
aws_s3_object.redirects["/structured-logging"]: Refreshing state... [id=/structured-logging]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html]
aws_s3_object.redirects["/concepts/basic/json-format.html"]: Refreshing state... [id=/concepts/basic/json-format.html]
aws_s3_object.redirects["/parameters/parameters.html"]: Refreshing state... [id=/parameters/parameters.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/voltdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/voltdb.html]
aws_s3_object.redirects["/change-types/community/home.html"]: Refreshing state... [id=/change-types/community/home.html]
aws_s3_object.redirects["/change-types/pro/enable-trigger.html"]: Refreshing state... [id=/change-types/pro/enable-trigger.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-synchub.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivateChangeLog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-deactivateChangeLog.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-updateSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-updateSQL.html]
aws_s3_object.redirects["/concepts/changeset.html"]: Refreshing state... [id=/concepts/changeset.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-comment-check.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-truncate-table-warn.html]
aws_s3_object.redirects["/commands/change-tracking/set-contexts.html"]: Refreshing state... [id=/commands/change-tracking/set-contexts.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/flagr-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/flagr-feature-flags-extension.html]
aws_s3_object.redirects["/commands/quality-checks/parameters/checks-scope.html"]: Refreshing state... [id=/commands/quality-checks/parameters/checks-scope.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migratesql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migratesql.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql-attribute.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql-attribute.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/user.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/user.html]
aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/object-name-must-not-match.html]
aws_s3_object.redirects["/concepts/changelogs/includeall.html"]: Refreshing state... [id=/concepts/changelogs/includeall.html]
aws_s3_object.redirects["/concepts/yaml-format.html"]: Refreshing state... [id=/concepts/yaml-format.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/feature-flags/readmes/Usage.html"]: Refreshing state... [id=/feature-flags/readmes/Usage.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/start/tutorials/mssql.html"]: Refreshing state... [id=/start/tutorials/mssql.html]
aws_s3_object.redirects["/concepts/changelogs/runonchange.html"]: Refreshing state... [id=/concepts/changelogs/runonchange.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-windows.html]
aws_s3_object.redirects["/commands/status-verbose.html"]: Refreshing state... [id=/commands/status-verbose.html]
aws_s3_object.redirects["/concepts/advanced/outputfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/outputfile-parameter.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/diffdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/diffdatabase.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/community/deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/registerChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/registerChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/deactivate-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/deactivate-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/register-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/register-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/sync-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/sync-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/init/hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/init/hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/liquibase-start/init-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/liquibase-start/init-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/sql-plus-troubleshoot.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/sql-plus-troubleshoot.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-troubleshoot.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-psql-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-psql-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/postgresql-psql" -> "/liquibase-pro/native-executors/postgresql-psql"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sql-plus-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus.html" -> "/liquibase-pro/native-executors/oracle-sqlplus.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sqlcmd-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sqlcmd-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mssql-server-sqlcmd.html" -> "/liquibase-pro/native-executors/mssql-server-sqlcmd.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-psql-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/postgresql-psql" -> "/liquibase-pro/native-executors/postgresql-psql"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sql-plus-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus.html" -> "/liquibase-pro/native-executors/oracle-sqlplus.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sqlcmd-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sqlcmd-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mssql-server-sqlcmd.html" -> "/liquibase-pro/native-executors/mssql-server-sqlcmd.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/database-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/database-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/database-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/database-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/drift-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/drift-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-drift-report.html" -> "/liquibase-pro/observability/operation-reports-drift-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/drift-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/drift-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-drift-report.html" -> "/liquibase-pro/observability/operation-reports-drift-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/mdc"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/mdc"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/observability"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/observability"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/home.html" -> "/liquibase-pro/observability/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/observability.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/observability.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/home.html" -> "/liquibase-pro/observability/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/operation-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/operation-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/operation-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/operation-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro/mongodb-changelog-formats.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro/mongodb-changelog-formats.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro/using-mongosh-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro/using-mongosh-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-changelog-formats.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb/mongodb-changelog-formats.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/using-mongosh-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb/using-mongosh-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/structured-logging"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/structured-logging"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/auto-registration-and-report-links.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/auto-registration-and-report-links.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/commands.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/commands.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/devops-metrics.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/devops-metrics.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/home.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/home.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/operations.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/organizations.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/organizations.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/pipelines.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/pipelines.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/projects.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/projects.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/properties.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/properties.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/release-notes.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/release-notes.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/setup.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/setup.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/user.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/user.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivate-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivate-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivateChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivateChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-register-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-register-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-registerChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-sync-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-sync-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-syncHub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-syncHub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/workflows/hub-pom-attributes.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/workflows/hub-pom-attributes.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/benefits.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/benefits.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/benefits.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/best-practices.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/best-practices.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/best-practices.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/mongodb-mongosh.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/mongodb-mongosh.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/mongodb-mongosh.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/msqql-server-sqlcmd.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/msqql-server-sqlcmd.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/msqql-server-sqlcmd.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-troubleshoot.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/postgresql-psql.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/postgresql-psql.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/postgresql-psql.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/database-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/meta-data-structured-logs.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging-custom-data.html" -> "/liquibase-pro/observability/structured-logging-custom-data.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-checks-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-checks-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-run-report.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/operation-reports-checks-run-report.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-checks-report.html" -> "/liquibase-pro/observability/operation-reports-checks-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-drift-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-drift-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-drift-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-rollback-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-rollback-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-rollback-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-update-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-update-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-update-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-custom-data.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-custom-data.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-custom-data.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-keys.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-keys.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-keys.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging.html"
    }

Plan: 18 to add, 62 to change, 0 to destroy.

[01J4GYQA0QXXBSZB7DT0EDZ230] Changes are GO
[01J4GYQA0QXXBSZB7DT0EDZ230] Uploading the list of managed resources...
[01J4GYQA0QXXBSZB7DT0EDZ230] Generating Infracost JSON report from plan

[01J4GYQA0QXXBSZB7DT0EDZ230] Infracost report generated successfully
[01J4GYQA0QXXBSZB7DT0EDZ230] Mapping Infracost data to resources
[01J4GYQA0QXXBSZB7DT0EDZ230] Costs mapped successfully
[01J4GYQA0QXXBSZB7DT0EDZ230] Please be aware that the run changes calculation includes output changes.
[01J4GYQA0QXXBSZB7DT0EDZ230] Resource list upload is GO
[01J4GYQA0QXXBSZB7DT0EDZ230] Generating JSON representation of the plan...
[01J4GYQA0QXXBSZB7DT0EDZ230] JSON representation is GO
[01J4GYQA0QXXBSZB7DT0EDZ230] Generating Infracost JSON report from plan

[01J4GYQA0QXXBSZB7DT0EDZ230] Infracost report generated successfully
[01J4GYQA0QXXBSZB7DT0EDZ230] Loading custom plan policy inputs...
[01J4GYQA0QXXBSZB7DT0EDZ230] 0 custom plan policy inputs found
[01J4GYQA0QXXBSZB7DT0EDZ230] No plan policies to evaluate
```

</details>